{
  "updates": [
    {
      "date": "30/03/2020",
      "description": "This update (30 March 2020) adds:\n\nThis new '!cn update' command, allowing users to quickly see any changes or new features added since the last update\n\nA new '!cn issue' command, which allows users to report issues or give feedback on the bot which will be logged for the developer (will try to fix these issues as soon as possible)\n\nA welcome message from the bot when added/active in the channel (will respond the first time a message is sent in a channel)\n\n"
    },
    {
      "date": "01/04/2020",
      "description": "This update (1 April 2020) adds:\n\nThank you for those users who have reported issues receiving Spymaster grids. This is not something I can fix on my end, as it relates to users' privacy settings.\n\nTo fix this, please change your settings to allow messages in DM from the Bot, OR you can message the Bot first (click their name in the channel and send any message) which will allow the Bot to send you a Direct Message.\n\nApologies to anyone having these issues, and please do continue to raise any issues with the developer using '!cn issue <description>'\n\nFinally, you can find more information about this Bot and my upcoming new Discord Bots at my new site:\n\nhttps://eclectic-matt.github.io/Isolation-Bots/\n\n"
    },
    {
      "date": "08/04/2020",
      "description": "This update (8 April 2020) adds:\n\nApologies to anyone who kept receiving the welcome messages, this has been fixed by logging channels on the server side so they no longer get repeated welcome messages.\n\nIf you are finding any other issues, please log with the developer using '!cn issue <description>' - these are also saved server-side to prevent any losses due to Heroku free dyno limitations!\n\nFinally, you can find more information about this Bot and my upcoming new Discord Bots at my new site:\n\nhttps://eclectic-matt.github.io/Isolation-Bots/\n\n"
    },
    {
      "date": "11/04/2020",
      "description": "Update (11 April 2020):\n\nJust want to say a huge **thank you** to everyone using the Codenames Bot, now in a fairly solid state.\nThe Bot is now hosted locally and this allows for easier updating and logging.\n\nThe welcome message issue should be fixed with this update for good, you may just get one last welcome message from this update but that should be the final one!\n\nIf you are finding any other issues, please log with the developer using '!cn issue <description>'\n\nFinally, you can find more information about this Bot and my upcoming new Discord Bots at my new site:\n\nhttps://eclectic-matt.github.io/Isolation-Bots/\n\n"
    }
  ]
}
